# Part 1

#### A. Import data and libraries

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# set folder path

path = r'C:\Users\shyro\OneDrive\Documents\Instacart Basket Analysis'

In [5]:
# Import customers.csv

df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [6]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [7]:
df_customers.shape

(206209, 10)

#### B. Data wrangling

In [8]:
# drop unnecessary columns for the analysis

df_customers = df_customers.drop(columns = ['First Name','Surnam'])

In [17]:
# confirm that 2 columns were removed

df_customers.shape

(206209, 8)

##### Column count went from 10 to 8 which confims that columns First Name and Surnam were dropped.

In [13]:
# rename columns 

df_customers.rename(columns = {'n_dependants' : 'no_of_dependants','fam_status' : 'marital_status'}, inplace = True)

In [14]:
# check renamed columns

df_customers.head()

,user_id,Gender,STATE,Age,date_joined,no_of_dependants,marital_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

#### C. Data consistency checks

In [15]:
# data integrity check

df_customers.describe()

             user_id            Age  no_of_dependants         income
count  206209.000000  206209.000000     206209.000000  206209.000000
mean   103105.000000      49.501646          1.499823   94632.852548
std     59527.555167      18.480962          1.118433   42473.786988
min         1.000000      18.000000          0.000000   25903.000000
25%     51553.000000      33.000000          0.000000   59874.000000
50%    103105.000000      49.000000          1.000000   93547.000000
75%    154657.000000      66.000000          3.000000  124244.000000
max    206209.000000      81.000000          3.000000  593901.000000

##### Nothing seems out of the ordinary in the results. Everything appears to be in range.

In [16]:
# find any duplicated values

df_customers[df_customers.duplicated()]

Empty DataFrame
Columns: [user_id, Gender, STATE, Age, date_joined, no_of_dependants, marital_status, income]
Index: []

##### No duplicated values were present in the datafame

In [18]:
# check for mixed types

for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

##### No mixed types present in the customers dataframe

#### D. Merge customer and order dataframes

In [19]:
# Import ords_prods_merged_grouped_aggregated.pkl

ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merged_grouped_aggregated.pkl'))

In [22]:
# merge ords_prods_merge and df_customers using user_id as the key

df_cust_ords_prods_merge = pd.merge(ords_prods_merge, df_customers, on = 'user_id', how = 'outer')

In [23]:
# check combined dataframes

df_cust_ords_prods_merge.head()

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,spending_flag,median_freq,frequency_flag,Gender,STATE,Age,date_joined,no_of_dependants,marital_status,income
0,2539329,1,prior,1,2,8,NaN,196,1,0,...,High spender,30.0,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,prior,2,3,7,15.0,196,1,1,...,High spender,30.0,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,prior,3,3,12,21.0,196,1,1,...,High spender,30.0,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,prior,4,4,7,29.0,196,1,1,...,High spender,30.0,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,prior,5,4,15,28.0,196,1,1,...,High spender,30.0,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423

In [25]:
# check new shape of merged dataframe

df_cust_ords_prods_merge.shape

(32404859, 32)

In [27]:
# export df_cust_ords_prods_merge to pkl file

df_cust_ords_prods_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_all.pkl'))